import { defineStore } from 'pinia'

export const useLevelStore = defineStore('level', {
  state: () => ({
    levels: {
      hard: [],
      soft: []
    },
    levelsDesc: {
      hard: [
        {
          name: 'Level 1: Foundational',
          type: 'Hard Skill',
          desc: 'มีทักษะและความรู้พื้นฐานที่เกี่ยวข้องกับบทบาทในงาน ดำเนินงานเบื้องต้นภายใต้การดูแลระดับสูง ต้องการคำแนะนำในการปฏิบัติงานอย่างมีประสิทธิภาพและมีอิสระในการตัดสินใจเล็กน้อย'
        },
        {
          name: 'Level 2: Developing Competence',
          type: 'Hard Skill',
          desc: 'สามารถแสดงความสามารถที่ขยายออกไปนอกเหนือจากพื้นฐานและสามารถดำเนินงานได้โดยมีอิสระบางส่วน แต่ยังคงต้องการควบคุมในงานที่ซับซ้อน เริ่มมีการแก้ปัญหาพื้นฐานภายในขอบเขตของงานของตน'
        },
        {
          name: 'Level 3: Competent Performance',
          type: 'Hard Skill',
          desc: 'มีความรู้ความสามารถในระดับที่มั่นใจกับการปฏิบัติงานที่หลากหลายด้วยตนเอง ทำงานอย่างอิสระได้มากขึ้น โดยมีการขอคำแนะนำสำหรับงานที่ท้าทาย เริ่มฝึกการตัดสินใจในขอบเขตของความรับผิดชอบของตน'
        },
        {
          name: 'Level 4: Advanced',
          type: 'Hard Skill',
          desc: 'มีทักษะและความรู้ขั้นสูง ทำงานอย่างอิสระโดยมีการควบคุมต่ำที่สุด จัดการงานที่ซับซ้อนและตัดสินใจเองในความเชี่ยวชาญของตน'
        },
        {
          name: 'Level 5: Specialized',
          type: 'Hard Skill',
          desc: 'ได้รับการยอมรับว่าเป็นผู้เชี่ยวชาญในสาขาของตน แสดงศักยภาพในการเป็นผู้นำและมีส่วนร่วมในนวัตกรรม มีการแก้ปัญหาที่ซับซ้อนและมีความรู้และความเชี่ยวชาญลึกลงไป'
        },
        {
          name: 'Level 6: Strategic Leadership',
          type: 'Hard Skill',
          desc: 'มีทักษะเพียงพอสำหรับตำแหน่งผู้นำหรือผู้บริหาร กำหนดทิศทางกลยุทธ์และวิสัยทัศน์สำหรับองค์กร ตัดสินใจในสิ่งที่มีผลกระทบต่อความสำเร็จในระยะยาวได้ ใช้มุมมองที่กว้างขวาง'
        },
      ],
      soft: [
        {
          name: 'Basic',
          type: 'Soft Skill',
          desc: 'มีความรู้และความเข้าใจพื้นฐาน/แนวความคิดพื้นฐาน ทำให้สามารถประยุกต์ใช้ทักษะและเทคนิคพื้นฐานภายใต้การดูแล แสดงการตัดสินใจอย่างจำกัดโดยขึ้นอยู่กับขั้นตอนที่กำหนดไว้เพื่อดำเนินงานอย่างมีประสิทธิภาพ'
        },
        {
          name: 'Intermediate',
          type: 'Soft Skill',
          desc: 'มีและสามารถแสดงความรู้/ทักษะที่ขยายออกไปนอกเหนือจากระดับพื้นฐาน ทำให้สามารถดำเนินงานได้โดยอิสระ มีความเชี่ยวชาญเพิ่มขึ้น ในขณะที่ยังคงต้องพัฒนามากขึ้น มีการตัดสินใจในขอบเขตของความรับผิดชอบ ซึ่งทำให้เกิดความก้าวหน้าและมีอิสระมากขึ้น'
        },
        {
          name: 'Advanced',
          type: 'Soft Skill',
          desc: 'มีความรู้และความเชี่ยวชาญที่ครอบคลุมในสาขางาน แสดงความเชี่ยวชาญระดับสูงในการจัดการงานที่ซับซ้อนโดยอิสระ ตัดสินใจอย่างอิสระโดยใช้ประสบการณ์และความชำนาญอย่างมากเพื่อให้เกิดผลลัพธ์และหาทางแก้ปัญหา ทำให้เห็นให้เห็นถึงระดับความสามารถที่ขั้นสูง'
        }
      ]
    },
    typesDesc: {
      hard: 'ทักษะและความสามารถด้านเทคนิค ซึ่งประกอบด้วยความรู้ ทักษะ และความสามารถเฉพาะด้านอาชีพ/งาน ที่บุคคลจำเป็นต้องมีเพื่อปฏิบัติงานต่างๆ',
      soft: 'กลุ่มของพฤติกรรมที่สามารถถ่ายทอดได้ ซึ่งสังเกตได้ และจะถูกนิยามเป็นทักษะที่สามารถนำไปใช้ในการทำงานภาคส่วนต่างๆ ตามขอบเขตงาน และบทบาทงานได้'
    }
  }),

  getters: {
    level: (state) => state.levels,
    levelDesc: (state) => state.levelsDesc,
    typeDesc: (state) => state.typesDesc
  },

  actions: {
    setLevel(item) {
      let hard = []
      let soft = []
      item.forEach((level) => {
        if (level.levelId <= 6) {
          hard.push(level)
        } else {
          soft.push(level)
        }
      })
      this.levels = {
        hard,
        soft
      }
    },
  },
})
